blog/20201015.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-05 Thu 20:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to Install Arch</title>
<meta name="author" content="Mark Hartigan" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com">
<link href="https://fonts.googleapis.com/css2?family=Ubuntu+Mono&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
<link rel="icon" type="image/png" href="ref/favicon.png" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">How to Install Arch</h1>


<div id="outline-container-org66d2939" class="outline-2">
<h2 id="org66d2939">October 15th, 2020 (posted on January 1st, 2021)</h2>
<div class="outline-text-2" id="text-org66d2939">
<p>
[NOTE] this guide has only been verified on a virtual machine, YMMV
</p>

<ol class="org-ol">
<li><p>
go through <a href="https://wiki.archlinux.org/index.php/installation_guide">normal setup</a> until chrooted  
</p>

<div class="org-src-container">
<pre class="src src-shell">   pacman -S dhcpcd dhcp dnsmasq base-devel emacs grub efibootmgr netctl
</pre>
</div></li>

<li>Continue until bootloader</li>

<li>Install <code>grub</code></li>

<li>Reboot</li>

<li><p>
Set up networking
</p>

<div class="org-src-container">
<pre class="src src-shell">   systemctl enable dhcpcd.service
   systemctl enable systemd-resolved --now
   <span style="color: #21bfc2;">ln</span> -sf /run/systemd/resolve/resolv.conf /etc/resolv.conf
</pre>
</div></li>

<li><p>
Add a new user
</p>

<div class="org-src-container">
<pre class="src src-shell">   useradd -m &lt;user&gt;
   passwd &lt;user&gt;
   usermod --append --groups wheel &lt;user&gt;
   <span style="color: #b877db;">export</span> <span style="color: #e95678;">EDITOR</span>=/usr/bin/emacs
   visudo
</pre>
</div>

<p>
Find the wheel group in the <b>User Privilege Specification</b> section and uncomment so it looks like this:
</p>

<div class="org-src-container">
<pre class="src src-shell">   <span style="color: #4e5059;">## </span><span style="color: #4e5059;">Uncomment to allow members of group wheel to execute any command</span>
   %wheel <span style="color: #e95678;">ALL</span>=<span style="color: #21bfc2;">(</span>ALL<span style="color: #21bfc2;">)</span> ALL
</pre>
</div></li>

<li><p>
Set up a Desktop Environment (XFCE)
</p>

<div class="org-src-container">
<pre class="src src-shell">   pacman -S xfce4 xfce4-goodies xorg-server
   <span style="color: #4e5059;">##</span><span style="color: #4e5059;">Ensure you're logged in as a user, not root</span>
   <span style="color: #21bfc2;">echo</span> exec startxfce4 &gt;&gt; ~/.xinitrc
</pre>
</div></li>

<li><p>
Automatically boot into desktop
</p>

<p>
Edit <code>~/.bash_profile</code> and append the following to the end:
</p>
<div class="org-src-container">
<pre class="src src-shell">   <span style="color: #b877db;">if</span> <span style="color: #21bfc2;">[</span><span style="color: #6c6f93;">[</span> <span style="color: #21bfc2; font-weight: bold;">!</span> $<span style="color: #e95678;">DISPLAY</span> &amp;&amp; $<span style="color: #e95678;">XDG_VTNR</span> -eq <span style="color: #f09383; font-weight: bold;">1</span> <span style="color: #6c6f93;">]</span><span style="color: #21bfc2;">]</span>; <span style="color: #b877db;">then</span>
     <span style="color: #b877db;">exec</span> startx
   <span style="color: #b877db;">fi</span>
</pre>
</div></li>

<li>Reboot</li>
</ol>

<p>
Congrats! Enjoy your Arch installation!!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Author: Mark Hartigan (<a href="mailto:mark.hartigan@protonmail.com">mark.hartigan@protonmail.com</a>)<br>Last Modified: 2021-08-05 Thu 20:52<br><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5)<br>Background created using <a href=https://github.com/nickymarino/virgo>Virgo</a></p>
</div>
</body>
</html>
